{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electrical Engineering",
      "duration": "2015-2019",
      "school_name": "Carleton University"
    },
    {
      "awards_achievements": null,
      "degree": "Post-Graduate Certificate",
      "department": "Database Application Development",
      "duration": "2020-2021",
      "school_name": "Seneca College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_GauthamanGnanasekaran",
  "highlighted_projects": [
    {
      "description": "Programmed a simulation of electrons interacting with each other in a closed environment with a population of 3000. This is then used to plot the Boltzman distribution of each electron.This is done using MATLAB ",
      "git_url": "https://github.com/GauthamanGnanasekaran/Electron-Modelling",
      "name": "Electrong Modelling"
    },
    {
      "description": "Collaborated and created a web application with 2 other team members. This site allows users to host URL for their indie games. Registeres users will be able to like and dislike the game posted. The application has admin page, that allows to ban/delete/approve URL's that has been posted by the user.",
      "git_url": "https://github.com/GauthamanGnanasekaran/Cap805-FrontEnd ",
      "name": "Capstone Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project will log the hardware specifications and the usage of the server to a database. The project uses bash script and CRON agent to log the usage every minute. This is then saved to a PostgreSQL container created using a docker image.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: This project used the Spring framework to perform CRUD operations by connecting to the Twitter API.The twitter API uses oAuth version 1.0. The initial connection was made with postman to check if the authentication and authorization process was working correctly. The initial Create, Read, Delete operations was performed using postman as well. The java application utilised the Model, View, Controller (MVC) Architecture. The connection was handled by the HttpHelper class, the business logic was handled by the Service class, the controller was used to handle the user input. This project was tested using mockito and JUnit. The application was packaged using maven and deployed using Docker.",
        "JDBC App: This project uses Java Datatabase Connectivity interface to connect the java program to API from Java to postgreSQL. The project also implements the Data Access Object patter for the API. The project used postgresSQL docker container, and dbeaver workbench which worked as the GUI. The java application was able to perform CRUD operations, and the driver class was used to handle the database connection.",
        "Grep App: This project will implement the same functionality as the grep bash command from Linux. The command will match patterns/lines in files recursively. The pattern that is inserted by user has to be Java REGEX. The application is packaged using Maven, and dockeried. It can be ran by JAR or by the docker container."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Gauthaman Gnanasekaran",
  "others": [
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developing and implementing projects using software and frameworks are currently used in the industry such as Java, GIT, SpringBoot, docker, PSQL, bash script, etc. Projects are implemented with agile framework in mind.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Cancard INC",
      "description": "Worked on normalizing the database and reducing data redundancy of Cancard's software as a service application. Contributed to the Model View Controller pattern for springboot.",
      "duration": "2022- April to June",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "SQL",
      "Node.js",
      "SpringBoot",
      "HTML",
      "CSS"
    ],
    "familiar": [
      "Docker",
      "C",
      "MatLab",
      "Python",
      "Linux/Bash"
    ],
    "proficient": [
      "Java",
      "JavaScript",
      "React",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate and an avid learner that is always seeking ways to improve my skill as a programmer. I graduated in Carleton University with a Bachelor's in Electrical Engineering. I also recently got a postgraduate certificate in Seneca for Database Application Development. My main strengths are learning/grasping new things quickly, being a team player that is committed to producing the best outcome for the team as a whole, and adapting to fast-paced environments."
}
