{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electrical Engineering",
      "duration": "2015-2019",
      "school_name": "Carleton University"
    },
    {
      "awards_achievements": null,
      "degree": "Post-Graduate Certificate",
      "department": "Database Application Development",
      "duration": "2020-2021",
      "school_name": "Seneca College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_GauthamanGnanasekaran",
  "highlighted_projects": [
    {
      "description": "Programmed a simulation of electrons interacting with each other in a closed environment with a population of 3000. This is then used to plot the Boltzman distribution of each electron.This was done using MATLAB.",
      "git_url": "https://github.com/GauthamanGnanasekaran/Electron-Modelling",
      "name": "Electron Modelling"
    },
    {
      "description": "This project is an indie game hosting website where registered users can post their URL to the games they have created. The front-end was built using React and the backend was built using PostgreSQL and Express (NodeJS).",
      "git_url": "https://github.com/GauthamanGnanasekaran/Cap805-FrontEnd ",
      "name": "Capstone Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Cluster Monitoring Agent will monitor, and log reports of system hardware and performance for each Linux system on the server.The project uses bash script and CRON agent to log the usage every minute. This is then saved to a PostgreSQL container created using a docker image.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: This is a CRUD (Create, Read, Update, Delete) application that will create, delete, and read tweets. The project uses Spring Framework and Data Access Object (DAO) pattern to communicate and handle data with Twitters REST API. JUnit4 and Mockito were used to perform unit tests and integration tests. The application was packaged using Maven, and was uploaded to Docker Hub after being dockerized",
        "JDBC App: This is a Java Database Connectivity Application that was created to get familiar with DAO pattern and the JDBC API. The application can perform CRUD operations and queries. This application was built using Java, Maven, PostgresQL, and Docker.",
        "Grep App: This project emulates the same functionality as the grep bash command from Linux by recursively matching patterns/lines provided within files. The application is built using Java 8, packaged by Maven, and deployed to Dockerhub as an image."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Gauthaman Gnanasekaran",
  "others": [
    {
      "bullets": [
        "I love outdoor activities such as trail cycling, canoeing, and fishing",
        "I am a huge fan of escape rooms and have fully solved 7 so far with my friends",
        "I am a casual gamer and I like playing japanese RPGs and strategy games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developing and implementing projects using software and frameworks are currently used in the industry such as Java, GIT, SpringBoot, docker, PSQL, bash script, etc. Projects are implemented with agile framework in mind.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Cancard INC",
      "description": "Worked on normalizing the database and reducing data redundancy of Cancard's software as a service application. Contributed to the Model View Controller pattern for springboot.",
      "duration": "2022- April to June",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "SQL",
      "Node.js",
      "SpringBoot",
      "HTML",
      "CSS"
    ],
    "familiar": [
      "Docker",
      "C",
      "MatLab",
      "Python",
      "Linux/Bash"
    ],
    "proficient": [
      "Java",
      "JavaScript",
      "React",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am an Electrical Engineering graduate from Carleton University with a post-graduate certificate  in Database Application Development from Seneca with prior experience as a full-stack developer. Previously, I worked at Cancard INC as a full stack developer working on a database normalization project with a tight completion timeline. In doing so, I learned to thrive in a fast paced environment,  communicate with diverse stakeholders, and grasp new technical concepts quickly. I am hoping to find a place to develop my career further as a backend software engineer."
}
